import 'package:safty_children/features/topics/models/knowledge_model.dart';

final List<Knowledgemodel> poisoningKnowledge = [
  Knowledgemodel(
    title: 'مقدمة',
    subtitle:
        '''تُعَدُّ الإسعافات الأولية للأطفال مهارة حيوية يجب أن يتقنها الآباء ومقدمو الرعاية، نظرًا لفضول الأطفال وحركتهم الدائمة التي قد تعرضهم للإصابات. يُسهم التدخل السريع والفعّال في تقليل المضاعفات وحماية حياة الطفل.''',
  ),
  Knowledgemodel(
    title: 'أهمية تعلُّم الإسعافات الأولية للأطفال',
    subtitle:
        '''⦁ الوقاية من المخاطر: معرفة كيفية التعامل مع الإصابات الشائعة تساهم في تقليل تأثيرها.
⦁ تعزيز الثقة: امتلاك المهارات اللازمة يمنح الآباء الثقة في التعامل مع المواقف الطارئة.
⦁ حماية حياة الطفل: التدخل السريع يمكن أن يكون فارقًا بين الحياة والموت في بعض الحالات.''',
  ),
  Knowledgemodel(
    title: 'مفهوم الإسعافات الأولية',
    subtitle:
        '''الإسعافات الأولية هي الرعاية العاجلة المقدمة لشخص مصاب أو مريض بشكل مفاجئ، بهدف الحفاظ على حياته وتقليل تفاقم الحالة حتى وصول المساعدة الطبية المتخصصة.''',
  ),
  Knowledgemodel(
    title: 'أهداف الإسعافات الأولية',
    subtitle: '''⦁ الحفاظ على حياة المصاب: من خلال التدخل السريع لمنع الوفاة
⦁ منع تفاقم الحالة: باتخاذ إجراءات تحول دون تدهور الوضع الصحي للمصاب
⦁ تخفيف الألم والمعاناة: بتقديم الدعم الجسدي والنفسي للمصاب
⦁ تعزيز الشفاء: توفير الرعاية الأولية التي تساهم في تسريع عملية التعافي''',
  ),
  Knowledgemodel(
    title: 'أنواع الإسعافات الأولية',
    subtitle: '''⦁ إسعافات الإصابات الجسدية: مثل الجروح، الحروق، الكسور، والنزيف
⦁ إسعافات الحالات الطبية الطارئة: مثل حالات الإختناق والتسمم
⦁ إسعافات الإصابات البيئية: مثل ضربة الشمس، انخفاض حرارة الجسم، ولسعات الحشرات''',
  ),
  Knowledgemodel(
    title: 'التحديات أثناء ممارسة الإسعافات الأولية',
    subtitle:
        '''⦁ عدم توفر أدوات الإسعاف اللازمة: مما قد يعيق تقديم الرعاية المناسبة
⦁ قلة التدريب أو الخبرة: قد يؤدي إلى تقديم إسعافات غير صحيحة أو تأخير في التدخل
⦁ الخوف أو التوتر: يمكن أن يؤثر على قدرة المسعف في التعامل مع الموقف بفعالية
⦁ وجود مخاطر بيئية: مثل الحرائق أو المواد الكيميائية، مما قد يعرض المسعف والمصاب للخطر''',
  ),
  Knowledgemodel(
    title: 'الساعة الحرجة لممارسة الإسعافات الأولية',
    subtitle:
        '''تشير "الساعة الذهبية" إلى الفترة الزمنية الحرجة بعد وقوع الإصابة، حيث يكون للتدخل السريع دور كبير في تحسين فرص النجاة وتقليل المضاعفات. خلال هذه الفترة، يمكن أن يكون للإسعافات الأولية الفعّالة تأثير إيجابي كبير على حالة المصاب.''',
  ),
  Knowledgemodel(
    title: 'مبادئ الإسعافات الأولية',
    subtitle:
        '''⦁ السلامة أولاً: تأكد من أن موقع الحادث آمن لك وللمصاب قبل تقديم المساعدة
⦁ التقييم السريع: قم بتقييم حالة المصاب بسرعة لتحديد نوع الإسعاف المطلوب.
⦁ طلب المساعدة: اتصل بخدمات الطوارئ فورًا للحصول على دعم طبي متخصص.
⦁ تقديم الرعاية الأساسية: ابدأ بتقديم الإسعافات الأولية المناسبة لحالة المصاب.
⦁ المراقبة المستمرة: راقب حالة المصاب باستمرار حتى وصول المساعدة المتخصصة.''',
  ),
  Knowledgemodel(
    title: 'مفهوم التسمم عند الأطفال',
    subtitle:
        '''التسمم هو دخول مادة ضارة إلى الجسم بكمية معينة تؤدي إلى إحداث أضرار صحية. يمكن أن تكون هذه المواد طبيعية أو مصنعة، وتدخل الجسم بطرق مختلفة.''',
  ),
  Knowledgemodel(
    title: 'أسباب التسمم عند الأطفال',
    subtitle: '''⦁ تناول مواد سامة عن قصد أو بالخطأ.
⦁ التداخلات الدوائية غير المقصودة.
⦁ تناول أطعمة فاسدة أو ملوثة.
⦁ استنشاق مواد سامة.
⦁ التخزين غير السليم للمواد الكيميائية أو الأدوية.
⦁ عدم مراقبة الأطفال وترك المواد الضارة في متناول أيديهم.''',
  ),
  Knowledgemodel(
    title: 'طرق دخول السموم إلى الجسم',
    subtitle:
        '''⦁ عن طريق الفم: ابتلاع المواد السامة مثل الأدوية أو المواد الكيميائية.
⦁ عن طريق الاستنشاق: استنشاق الأبخرة أو الغازات السامة.
⦁ عن طريق الامتصاص عبر الجلد: ملامسة الجلد لمواد سامة تمتص عبره.
⦁ عن طريق الحقن: دخول المواد السامة مباشرة إلى الأنسجة أو الأوعية الدموية.''',
  ),
  Knowledgemodel(
    title: 'أنواع التسمم عند الأطفال',
    subtitle:
        '''⦁ تسمم غذائي: ناتج عن تناول أطعمة ملوثة بالبكتيريا أو الفيروسات.
⦁ تسمم كيميائي: ناتج عن التعرض لمواد كيميائية ضارة.
⦁ تسمم دوائي: ناتج عن تناول جرعات زائدة من الأدوية.''',
  ),
  Knowledgemodel(
    title: 'أعراض التسمم عند الأطفال',
    subtitle: '''⦁ غثيان وقيء.
⦁ ألم في البطن وإسهال.
⦁ دوار وصداع.
⦁ صعوبة في التنفس.
⦁ تغيرات في مستوى الوعي، مثل النعاس أو فقدان الوعي.
⦁ تشنجات أو نوبات صرع.''',
  ),
  Knowledgemodel(
    title: 'دور التمريض في حالة التسمم للأطفال',
    subtitle: '''⦁ التقييم السريع لحالة الطفل:
  - تحديد نوع المادة السامة وكمية التعرض ووقت حدوث التسمم.
  - تقييم العلامات الحيوية مثل التنفس والنبض والوعي.
  - تقييم مجرى الهواء والتنفس والدورة الدموية للطفل
  - وضع الطفل على جانبه الأيسر لتأخير امتصاص السم
⦁ تقديم الإسعافات الأولية المناسبة:
  في حالة التسمم عن طريق الفم:
  - عدم تحفيز القيء إلا بتوجيه من مختص طبي.
  - تقديم الماء أو الحليب لتخفيف تركيز المادة السامة، إذا كانت التعليمات الطبية تسمح بذلك.
  في حالة التسمم عن طريق الاستنشاق:
  - نقل الطفل إلى مكان ذو هواء نقي بعيدًا عن المصدر السام.
  - تقديم الأكسجين إذا لزم الأمر.
  في حالة التسمم عن طريق الجلد أو العين:
  - غسل المنطقة المصابة بكمية كبيرة من الماء الجاري.
  - إزالة الملابس الملوثة بعناية.''',
  ),
  Knowledgemodel(
    title: 'مشاكل ومضاعفات التسمم عند الأطفال',
    subtitle: '''⦁ فشل في وظائف الأعضاء الحيوية مثل الكلى أو الكبد.
⦁ اضطرابات في الجهاز العصبي قد تؤدي إلى تشنجات أو غيبوبة.
⦁ مشاكل تنفسية قد تتطلب دعمًا تنفسيًا.
⦁ في الحالات الشديدة، قد يؤدي التسمم إلى الوفاة.''',
  ),
  Knowledgemodel(
    title: 'مراجع حديثة',
    subtitle: '''مايو كلينك: "التسمم: الإسعافات الأولية"
وزارة الصحة والسكان المصرية: "أسباب الإصابة بالتسمم وقواعد الإسعافات الأولية"
المجلس الصحي المصري: "الإسعافات الأولية لحالات التسمم"''',
  ),
];
