import 'package:safty_children/features/topics/models/knowledge_model.dart';

final List<Knowledgemodel> chockingContent = [
  Knowledgemodel(
    title: 'مفهوم الاختناق عند الأطفال',
    subtitle:
        'الاختناق هو حالة طبية طارئة تحدث عندما يتم منع تدفق الهواء إلى الرئتين، مما يؤدي إلى نقص الأكسجين في الجسم. قد يحدث بسبب انسداد مجرى الهواء جزئيًا أو كليًا، مما يعرض حياة الطفل للخطر إذا لم يتم التدخل بسرعة.',
  ),
  Knowledgemodel(
    title: 'أسباب الاختناق عند الأطفال',
    subtitle:
        '• الأجسام الغريبة: ابتلاع أو استنشاق الطعام الصلب (مثل المكسرات) أو الأجسام الصغيرة (الألعاب، العملات المعدنية).\n'
        '• الاختناق بالسائل (الغرق الجاف): دخول السوائل إلى مجرى التنفس.\n'
        '• الاختناق بوضعية غير صحيحة: النوم على الوجه أو في وضعية تضغط على مجرى الهواء، خاصة عند الرضع.\n'
        '• الحساسية المفرطة: تورم الحلق نتيجة حساسية شديدة.\n'
        '• العدوى: مثل التهاب الحنجرة الحاد الذي يؤدي إلى تضييق مجرى الهواء.\n'
        '• الاختناق الناتج عن استنشاق الدخان أو الغازات السامة.',
  ),
  Knowledgemodel(
    title: 'أنواع الإختناق عند الأطفال',
    subtitle:
        '• اختناق جزئي: لا يزال هناك بعض تدفق الهواء، وقد يتمكن الطفل من السعال أو إصدار أصوات.\n'
        '• اختناق كلي: انسداد كامل لمجرى التنفس، مما يؤدي إلى فقدان القدرة على السعال أو التنفس أو الكلام.',
  ),
  Knowledgemodel(
    title: 'أعراض الإختناق عند الأطفال',
    subtitle:
        '• صعوبة أو توقف التنفس.\n'
        '• كحة قوية أو ضعيفة حسب النوع.\n'
        '• تغير لون الجلد إلى الأزرق أو الرمادي (الازرقاق).\n'
        '• فقدان الوعي في الحالات الشديدة.',
  ),
  Knowledgemodel(
    title: 'مضاعفات الإختناق عند الأطفال',
    subtitle:
        '• تلف الدماغ بسبب نقص الأكسجين إذا استمر الاختناق لأكثر من 4-6 دقائق.\n'
        '• توقف القلب في الحالات الشديدة.\n'
        '• الإلتهاب الرئوي.',
  ),
  Knowledgemodel(
    title: 'المراجع الحديثة',
    subtitle:
        'Hiwa et al., 2024: دراسة عن أهمية الذكاء الاصطناعي في دعم التمريض عند التعامل مع الطوارئ التنفسية.\n'
        'American Heart Association (AHA) Guidelines 2023: دليل الإنعاش القلبي الرئوي والإسعافات الأولية للأطفال.\n'
        'Pediatric Nursing Handbook, 2023: مرجع شامل حول التمريض في طب الأطفال.',
  ),
];
